// -----------------------------------------------------------------------
// ЗАДАЧА 1

// Задайте одномерный массив из 10 целых чисел от 1 до 100. 
// Найдите количество элементов массива, 
// значения которых лежат в отрезке [20,90].

Console.Clear();

int[] array = new int[10];

int count = 0;

for (int i = 0; i < array.Length; i++)
{
    array[i] = new Random().Next(1, 101); // [1;100]
    if ((array[i] >= 20) && (array[i] <= 90))
        count += 1;
}
    
Console.WriteLine($"массив [{string.Join(" ", array)}] => {count}");

// -----------------------------------------------------------------------




// -----------------------------------------------------------------------
// ЗАДАЧА 2

// Задайте массив на 10 целых чисел. 
// Напишите программу, которая определяет количество чётных чисел в массиве.

// Console.Clear();

int[] array2 = new int[10];

int count2 = 0;

for (int i = 0; i < array2.Length; i++)
{
    array2[i] = new Random().Next(-1000000, 1000001); // [-1000000;1000000]
    if (array2[i] % 2 == 0)
        count2 += 1;
}
    
Console.WriteLine($"массив [{string.Join(" ", array2)}] => {count2}");

// -----------------------------------------------------------------------




// -----------------------------------------------------------------------
// ЗАДАЧА 3

// Задайте массив из вещественных чисел с ненулевой дробной частью. 
// Найдите разницу между максимальным и минимальным элементами массива.

// ВАРИАНТ 1 (используется Math.Round() для отображения двух знаков после запятой)

// Console.Clear();

Console.Write("Введите кол-во элементов массива: ");
int n = Convert.ToInt32(Console.ReadLine());
double[] array3 = new double[n];

for(int i = 0; i < array3.Length; i++)
    array3[i] = new Random().Next(0, 1001) + Math.Round(new Random().NextDouble(), 2); //[0, 1000] + [0,00, 1,00)

double MinEl = array3[0];
double MaxEl = array3[0];

foreach (double e in array3)
{
    if (e < MinEl)
        MinEl = e;

    if (e > MaxEl)
        MaxEl = e;
}

Console.WriteLine($"массив [{string.Join(" ", array3)}] => {MaxEl - MinEl}");

// ------------------------------


// ВАРИАНТ 2 (применяется форматирование для отображения двух знаков после запятой)

// Console.Clear();

Console.Write("Введите кол-во элементов массива: ");
int n2 = Convert.ToInt32(Console.ReadLine());
double[] array4 = new double[n2];

for(int i = 0; i < array4.Length; i++)
    array4[i] = new Random().Next(0, 1001) + new Random().NextDouble(); //[0, 1000] + [0,00000.., 1,00000..)

double MinEl2 = array4[0];
double MaxEl2 = array4[0];

foreach (double e in array4)
{
    if (e < MinEl2)
        MinEl2 = e;

    if (e > MaxEl2)
        MaxEl2 = e;
}

Console.Write("массив [");
foreach (double e in array4)
    Console.Write("{0: 0.00}", e);
Console.Write($"] =>{MaxEl2 - MinEl2: 0.00}");

// -----------------------------------------------------------------------




// -----------------------------------------------------------------------
// ЗАДАЧА 4** (не обязательно)

// Дано натуральное число в диапазоне от 1 до 100 000. 
// Создайте массив, состоящий из цифр этого числа. 
// Старший разряд числа должен располагаться на 0-м индексе массива, 
// младший – на последнем. 
// Размер массива должен быть равен количеству цифр.

// Console.Clear();

int N = new Random().Next(1, 100001); //[1, 100000]

int N2 = N;

// Определяем количество цифр в данном числе
int j = 1;
while (N2 > 10)
{   j ++;
    N2 /= 10;
}

int[] array5 = new int[j];
j = j - 1;
N2 = N;

while (N2 > 0)
 {  
    array5[j] = N2 % 10;
    N2 /= 10;
    j -= 1;
 }

Console.Write($"{N} => [{string.Join(" ", array5)}]");

// -----------------------------------------------------------------------
// -----------------------------------------------------------------------